<?php

/**
 * Описание 
 */

return $lang = [
    'message' => [
        'no_controller' => 'Контроллер не знайдений: ',
        'no_action'     => 'Такого методу не існує: ',
        'empty_sql'     => 'SQL питання не може бути пустим',
        'error'         => 'Сторінка не існує, <br><br>  або у вас відсутні права доступу до неї!',
        'hide_login'    => 'Введіть логін, e-mail або номер телефону',
        'hide_pass'     => 'Мінімум 6 символів'
    ],
    'text' => [
        'greeting' =>
            '<h2>Ласкаво просимо на планету Mira!</h2>

            <p>Ти потрапив сюди разом з іншими випадковими подорожніми. На вас лежить важлива місія: процвітання і благополуччя планети.</p>

            <p>Mira існувала мільйони років. Люди заселили її лише недавно. Можливо, саме ти зіграєш вирішальну роль у долі людства планети Mira.</p>

            <p>Процвітання цивілізації!</p>'
    ],
    'button' => [
        'enter'        => 'Увійти',
        'forgot_pass'  => 'Забув пароль?',
        'registration' => 'Регістрація',
        'articles'     => 'Статті',
        'issue'           => 'Вопрос',
        'escape'       => 'Вихід',
        'add_article'  => 'Добавить новую статью',
        'edit_article'  => 'Редактировать статью',
        'delete_article'  => 'Видалити статтю',
        'read_more' => 'читать далее...',
        'add_issue'       => 'добавити питання',
    ],
    'error' => [
        'field' => 'Поле ',
        'required' => ' не должно быть пустым.',
        'string' => ' должно быть строкой.',
        'number' => ' должно быть числом',
        'min' => ' не должно иметь меньше символов чем',
        'max' => ' не должно иметь больше символов чем',
        'user_exist' => 'Такой пользователь существует!',
        'login' => ': использованы запрещенные символы.<br>  Только латинские буквы, цифры, "-" и "_".',
        'verify'=> 'Помилка авторизації!',
    ],
    'label' => [
        'login' => 'username',
        'pass' => 'password',
        'title_article' => 'Название статьи:',
        'text_article' => 'Текст статьи:',
    ],
    'load' => 'До будь-якого url-у через "/" в будь-якому місці, до масиву $ _GET <br> можна дописати 2 букви мови: ru, ua або en - <br> відбудеться глобальна зміна мови.',

];
